from enum import Enum

symbolToCode = {
    "А": ".-",
    "Б": "-...",
    "В": ".--",
    "Г": "--.",
    "Д": "-..",
    "Е": ".",
    "Ё": ".",
    "Ж": "...-",
    "З": "--..",
    "И": "..",
    "Й": ".---",
    "К": "-.-",
    "Л": ".-..",
    "М": "--",
    "Н": "-.",
    "О": "---",
    "П": ".--.",
    "Р": ".-.",
    "С": "...",
    "Т": "-",
    "У": "..-",
    "Ф": "..-.",
    "Х": "....",
    "Ц": "-.-.",
    "Ч": "---.",
    "Ш": "----",
    "Щ": "--.-",
    "Ъ": "--.--",
    "Ы": "-.--",
    "Ь": "-..-",
    "Э": "..-..",
    "Ю": "..--",
    "Я": ".-.-",

    "A": ".-",
    "B": "-...",
    "C": "-.-.",
    "D": "-..",
    "E": ".",
    "F": "..-.",
    "G": "--.",
    "H": "....",
    "I": "..",
    "J": ".---",
    "K": "-.-",
    "L": ".-..",
    "M": "--",
    "N": "-.",
    "O": "---",
    "P": ".--.",
    "Q": "--.-",
    "R": ".-.",
    "S": "...",
    "T": "-",
    "U": "..-",
    "V": "...-",
    "W": ".--",
    "X": "-..-",
    "Y": "-.--",
    "Z": "--..",

    #Русские и анлийские знаки оличаются (проверить и переделать)
    ".": "......",
    ",": ".-.-.-",
    ":": "---...",
    ";": "-.-.-.",
    "(": "-.--.-",
    ")": "-.--.-",
    "'": ".----.",
    '"': ".-..-.",
    "«": ".-..-.",
    "»": ".-..-.",
    "-": "-....-", # hyphen
    "—": "-....-", # mdash
    "−": "-....-", # ndash
    "/": "-..-.",
    "_": "..--.-",
    "?": "..--..",
    "!": "--..--",
    "+": ".-.-.",
    "@": ".--.-.",
    "…": "...... ...... ......",
    "%": ".--. .-. --- -.-. . -. -",
    "=": "-...-",

    "0": "-----",
    "1": ".----",
    "2": "..---",
    "3": "...--",
    "4": "....-",
    "5": ".....",
    "6": "-....",
    "7": "--...",
    "8": "---..",
    "9": "----.",

    " ": "/",
}

codeToSymbol = {
    #Русские и анлийские знаки оличаются (проверить и переделать)
    "...-..-": "$",

    "......": ".",
    ".-.-.-": ",",
    "---...": ":",
    "-.-.-.": ";",
    "-.--.-": "(",
    ".----.": "'",
    ".-..-.": '"',
    "-....-": "-",
    "..--.-": "_",
    "..--..": "?",
    "--..--": "!", #,
    ".--.-.": "@",

    ".....": "5",
    "....-": "4",
    "...--": "3",
    "..---": "2",
    ".----": "1",
    "-....": "6",
    "--...": "7",
    "---..": "8",
    "----.": "9",
    "-----": "0",
    "-..-.": "/",
    ".-.-.": "+",

    ".-...": "&",
    "-...-": "=",

    "/": " ",
}

codeToSymbolRU = codeToSymbol | {
    "..-..": "Э",
    "--.--": "Ъ",

    "....": "Х",
    "...-": "Ж",
    "..-.": "Ф",
    "..--": "Ю",
    ".-..": "Л",
    ".-.-": "Я",
    ".--.": "П",
    ".---": "Й",
    "-...": "Б",
    "-..-": "Ь",
    "-.-.": "Ц",
    "-.--": "Ы",
    "--..": "З",
    "--.-": "Щ",
    "---.": "Ч",
    "----": "Ш",

    "...": "С",
    "..-": "У",
    ".-.": "Р",
    ".--": "В",
    "-..": "Д",
    "-.-": "К",
    "--.": "Г",
    "---": "О",

    "..": "И",
    ".-": "А",
    "-.": "Н",
    "--": "М",

    ".": "Е",
    "-": "Т",
}

codeToSymbolEN = codeToSymbol | {
    "...-...": "Ś",
    
    "..-..": "É", #Ę
    "--.--": "Ń",
    ".-..-": "È",
    ".--.-": "Ê", #Ã
    "-.-..": "Ç",

    "....": "H",
    "...-": "V",
    "..-.": "F",
    "..--": "Ü",
    ".-..": "L",
    ".-.-": "Ä", #Ą
    ".--.": "P",
    ".---": "J",
    "-...": "B",
    "-..-": "X",
    "-.-.": "C",
    "-.--": "Y",
    "--..": "Z",
    "--.-": "Q",
    "---.": "Ö", #Ó
    "----": "Š", #Ĥ

    "...": "S",
    "..-": "U",
    ".-.": "R",
    ".--": "W",
    "-..": "D",
    "-.-": "K",
    "--.": "G",
    "---": "O",

    "..": "I",
    ".-": "A",
    "-.": "N",
    "--": "M",

    ".": "E",
    "-": "T",
}

latinToCyrillic = {
    "Q":"Й",
    "W":"Ц",
    "E":"У",
    "R":"К",
    "T":"Е",
    "Y":"Н",
    "U":"Г",
    "I":"Ш",
    "O":"Щ",
    "P":"З",
    "[":"Х",
    "]":"Ъ",
    "A":"Ф",
    "S":"Ы",
    "D":"В",
    "F":"А",
    "G":"П",
    "H":"Р",
    "J":"О",
    "K":"Л",
    "L":"Д",
    ";":"Ж",
    "'":"Э",
    "Z":"Я",
    "X":"Ч",
    "C":"С",
    "V":"М",
    "B":"И",
    "N":"Т",
    "M":"Ь",
    ",":"Б",
    ".":"Ю",
    "/":".",
}


class ConvertionType(Enum):
    """Типы конвертаций"""
    SYMBOL_MORSE = symbolToCode
    MORSE_SYMBOL_RU = codeToSymbolRU
    EN_RU_KEY = latinToCyrillic


class TextConverter:
    @staticmethod
    def convert(text: str, type: ConvertionType = ConvertionType.SYMBOL_MORSE):
        if not text: return text

        # if default==text - leave not founded text element
        # if default is None - skip not founded text element (do not add in result)
        default=None
        sep = ''
        match type:
            case ConvertionType.SYMBOL_MORSE:
                sequence = text.upper()
                sep=' '
            case ConvertionType.MORSE_SYMBOL_RU:
                sequence = text.split(' ')
            case ConvertionType.EN_RU_KEY:
                sequence = text.upper()
                default=text

        if len(text)==1:
            return type.value.get(text.upper(), default)
        
        res = []
        for el in sequence:
            if el in type.value:
                res.append(type.value[el])
            elif default:
                res.append(el)

        res_string = sep.join(res)
        return res_string



if __name__ == "__main__":
    print(latinToCyrillic.get('Y'))
    print(TextConverter.convert('hello123'))
    print(TextConverter.convert('h'))
    print(TextConverter.convert('ABDCKE123', ConvertionType.EN_RU))
    print(TextConverter.convert('A', ConvertionType.EN_RU))
    print(TextConverter.convert('.... . .-.. .-.. --- .---- ..--- ...--', ConvertionType.MORSE_SYMBOL_RU))